//////////////////////////////////ЗАДАНИЕ 1//////////////////////////////////
let kmh = 36;
let msec = 20;

console.log(`${kmh} соотвествует ${kmh / 3.6}`);
console.log(`${msec} соотвествует ${msec * 3.6}`);
//////////////////////////////////ЗАДАНИЕ 2//////////////////////////////////
let a = 10,
  b = 15,
  c = 7,
  P = a + b + c;
if (a + b > c && a + c > b && b + c > a) {
  console.log(`треугольник существует`);
  console.log(`Периметр = ${P}`);
  console.log(
    `Площадь = ${Math.sqrt((P / 2) * (P / 2 - a) * (P / 2 - b) * (P / 2 - c))}`
  );
  console.log(
    `Соотношение = ${
      P / Math.sqrt((P / 2) * (P / 2 - a) * (P / 2 - b) * (P / 2 - c))
    }`
  );
} else {
  console.log(`треугольник не существует`);
}

//////////////////////////////////ЗАДАНИЕ 3//////////////////////////////////

// let num = prompt("Введите число", 5);

// if (isNaN(num)) {
//   alert("Вы не ввели число");
// }

// for (let i = 0; i <= num; i++) {
//   if (i % 5 !== 0) {
//     console.log(`${i + (i % 2 === 0 ? " buzz" : " fizz")}`);
//   } else {
//     console.log(`${i} fizz buzz`);
//   }
// }

//////////////////////////////////ЗАДАНИЕ 4//////////////////////////////////
let str='*\n'; let g;
for (let j = 1; j <= 13; j++) {
    g = 0
  while (g <= j) {
    if (j % 2 !== 0) {
      str += "#";
    } else {
      str += "*";
    }
    g++;
  }
  str += "\n";
}
console.log(`${str + '||'}`);

//////////////////////////////////ЗАДАНИЕ 5//////////////////////////////////
//  let number;
//  let zag = 7;

// do
//  {
//   number = prompt("Введите число", 5)
//     if (isNaN(number)) {
//     alert("Вы не ввели число");
//   }
//   number = parseInt(number);
//   if (number > zag)
//   {
//     console.log(`Ваше число больше`)
//   }
//   if (number < zag)
//   {
//     console.log(`Ваше число меньше`)
//   }
//   if (number === zag)
//   {
//     console.log(`Ваше число верно`)
//   }
//  }  while (number !== zag)

//////////////////////////////////ЗАДАНИЕ 6//////////////////////////////////

//let n1 = 100, x1=5, y1=3;
let n1 = 12, x1=2, y1=6;

if ((n1 % x1 === 0) && (n1 % y1 === 0))
{
  console.log(`n = ${n1}, x = ${x1}, y = ${y1} => true`);
}
else{
  console.log(`n = ${n1}, x = ${x1}, y = ${y1} => false`);
}

//////////////////////////////////ЗАДАНИЕ 7//////////////////////////////////

let mes = 1;

if ((mes <= 3) && (mes > 0))
{
  console.log(`месяц ${mes} => 1 квартал`);
}
if ((mes <= 6) && (mes > 3))
{
  console.log(`месяц ${mes} => 2 квартал`);
}
if ((mes <= 9) && (mes > 6))
{
  console.log(`месяц ${mes} => 3 квартал`);
}
if ((mes <= 12) && (mes > 9))
{
  console.log(`месяц ${mes} => 4 квартал`);
}